In [1]:
# Import MySQL Connector/Python API
import mysql.connector as connector

In [2]:
# Step 1: Establish a connection 

# Establish a connection between Python and MySQL database
# user and password is removed when uploaded
connection=connector.connect(user="<UID>",password="<PWD>")
# connection=connector.connect(user="<USERNAME>",password="<PASSWORD>")

In [3]:
# Step 2: Create a cursor

# initalise a cursor object to communicate with MySQL
cursor = connection.cursor()

In [4]:
# Step 3: Create the database and set it for use

# create a new database little_lemon_db
# cursor.execute("CREATE DATABASE little_lemon_db")

In [4]:
# Set the database for use
cursor.execute("USE little_lemon_db")

In [5]:
cursor.execute("SHOW TABLES")
results = cursor.fetchall()
for i in results:
    # print(i)
    drop_query = "DROP TABLE IF EXISTS " + i[0];
    print(drop_query)
    cursor.execute(drop_query)

DROP TABLE IF EXISTS employees
DROP TABLE IF EXISTS menuitems
DROP TABLE IF EXISTS menus
DROP TABLE IF EXISTS orders

In [7]:
# Step 4: Create tables

# create table structures

In [6]:
#MenuItems table
create_menuitem_table = """CREATE TABLE MenuItems (
ItemID INT AUTO_INCREMENT,
Name VARCHAR(200),
Type VARCHAR(100),
Price INT,
PRIMARY KEY (ItemID)
);"""
cursor.execute(create_menuitem_table)

In [7]:
#Menu table
create_menu_table = """CREATE TABLE Menus (
MenuID INT,
ItemID INT,
Cuisine VARCHAR(100),
PRIMARY KEY (MenuID,ItemID)
);"""
cursor.execute(create_menu_table)

In [8]:
# Bookings table
create_booking_table = """CREATE TABLE Bookings (
BookingID INT AUTO_INCREMENT,
TableNo INT,
GuestFirstName VARCHAR(100) NOT NULL,
GuestLastName VARCHAR(100) NOT NULL,
BookingSlot TIME NOT NULL,
EmployeeID INT,
PRIMARY KEY (BookingID)
);"""
cursor.execute(create_booking_table)

In [9]:
# Orders table
create_orders_table = """CREATE TABLE Orders (
OrderID INT,
TableNo INT,
MenuID INT,
BookingID INT,
BillAmount INT,
Quantity INT,
PRIMARY KEY (OrderID,TableNo)
);"""
cursor.execute(create_orders_table)

In [10]:
# Employees table
create_employees_table = """CREATE TABLE Employees (
EmployeeID INT AUTO_INCREMENT PRIMARY KEY,
Name VARCHAR (255),
Role VARCHAR (100),
Address VARCHAR (255),
Contact_Number INT,
Email VARCHAR (255),
Annual_Salary VARCHAR (100)
);"""
cursor.execute(create_employees_table)

In [11]:
print(cursor.column_names)

()

In [12]:
# Step 5: Insert data

# populate tables in the little_lemon_db database
#*******************************************************#
# Insert query to populate "MenuItems" table:
#*******************************************************#
insert_menuitems="""
INSERT INTO MenuItems (ItemID, Name, Type, Price)
VALUES
(1, 'Olives','Starters',5),
(2, 'Flatbread','Starters', 5),
(3, 'Minestrone', 'Starters', 8),
(4, 'Tomato bread','Starters', 8),
(5, 'Falafel', 'Starters', 7),
(6, 'Hummus', 'Starters', 5),
(7, 'Greek salad', 'Main Courses', 15),
(8, 'Bean soup', 'Main Courses', 12),
(9, 'Pizza', 'Main Courses', 15),
(10, 'Greek yoghurt','Desserts', 7),
(11, 'Ice cream', 'Desserts', 6),
(12, 'Cheesecake', 'Desserts', 4),
(13, 'Athens White wine', 'Drinks', 25),
(14, 'Corfu Red Wine', 'Drinks', 30),
(15, 'Turkish Coffee', 'Drinks', 10),
(16, 'Turkish Coffee', 'Drinks', 10),
(17, 'Kabasa', 'Main Courses', 17);"""

#*******************************************************#
# Insert query to populate "Menu" table:
#*******************************************************#
insert_menu="""
INSERT INTO Menus (MenuID,ItemID,Cuisine)
VALUES
(1, 1, 'Greek'),
(1, 7, 'Greek'),
(1, 10, 'Greek'),
(1, 13, 'Greek'),
(2, 3, 'Italian'),
(2, 9, 'Italian'),
(2, 12, 'Italian'),
(2, 15, 'Italian'),
(3, 5, 'Turkish'),
(3, 17, 'Turkish'),
(3, 11, 'Turkish'),
(3, 16, 'Turkish');"""

#*******************************************************#
# Insert query to populate "Bookings" table:
#*******************************************************#
insert_bookings="""
INSERT INTO Bookings (BookingID, TableNo, GuestFirstName, 
GuestLastName, BookingSlot, EmployeeID)
VALUES
(1, 12, 'Anna','Iversen','19:00:00',1),
(2, 12, 'Joakim', 'Iversen', '19:00:00', 1),
(3, 19, 'Vanessa', 'McCarthy', '15:00:00', 3),
(4, 15, 'Marcos', 'Romero', '17:30:00', 4),
(5, 5, 'Hiroki', 'Yamane', '18:30:00', 2),
(6, 8, 'Diana', 'Pinto', '20:00:00', 5);"""

#*******************************************************#
# Insert query to populate "Orders" table:
#*******************************************************#
insert_orders="""
INSERT INTO Orders (OrderID, TableNo, MenuID, BookingID, Quantity, BillAmount)
VALUES
(1, 12, 1, 1, 2, 86),
(2, 19, 2, 2, 1, 37),
(3, 15, 2, 3, 1, 37),
(4, 5, 3, 4, 1, 40),
(5, 8, 1, 5, 1, 43);"""

In [15]:
# Populate MenuItems table
# cursor.execute("DROP TABLE Employees")
# connection.commit()

In [13]:
# Populate MenuItems table
cursor.execute(insert_menuitems)
connection.commit()

In [14]:
# Populate Menu table
cursor.execute(insert_menu)
connection.commit()

In [15]:
# Populate Bookings table
cursor.execute(insert_bookings)
connection.commit()

In [16]:
# Populate Orders table
cursor.execute(insert_orders)
connection.commit()

In [17]:
#*******************************************************#
# Insert query to populate "Employees" table:
#*******************************************************#
insert_employees = """
INSERT INTO Employees (EmployeeID, Name, Role, Address, Contact_Number, Email, Annual_Salary) VALUES
(1,'Mario Gollini','Manager','724, Parsley Lane, Old Town, Chicago, IL',351258074,'Mario.g@littlelemon.com','$70,000'),
(2,'Adrian Gollini','Assistant Manager','334, Dill Square, Lincoln Park, Chicago, IL',351474048,'Adrian.g@littlelemon.com','$65,000'),
(3,'Giorgos Dioudis','Head Chef','879 Sage Street, West Loop, Chicago, IL',351970582,'Giorgos.d@littlelemon.com','$50,000'),
(4,'Fatma Kaya','Assistant Chef','132  Bay Lane, Chicago, IL',351963569,'Fatma.k@littlelemon.com','$45,000'),
(5,'Elena Salvai','Head Waiter','989 Thyme Square, EdgeWater, Chicago, IL',351074198,'Elena.s@littlelemon.com','$40,000'),
(6,'John Millar','Receptionist','245 Dill Square, Lincoln Park, Chicago, IL',351584508,'John.m@littlelemon.com','$35,000');"""

In [18]:
cursor.execute("DESC Employees")
results = cursor.fetchall()
for i in results:
    print(i)

('EmployeeID', b'int', 'NO', 'PRI', None, 'auto_increment')
('Name', b'varchar(255)', 'YES', '', None, '')
('Role', b'varchar(100)', 'YES', '', None, '')
('Address', b'varchar(255)', 'YES', '', None, '')
('Contact_Number', b'int', 'YES', '', None, '')
('Email', b'varchar(255)', 'YES', '', None, '')
('Annual_Salary', b'varchar(100)', 'YES', '', None, '')

In [19]:
# Populate Employees table
cursor.execute(insert_employees)
connection.commit()

In [20]:
cursor.execute("SELECT * FROM Employees limit 2")
results = cursor.fetchall()
for i in results:
    print(i)

(1, 'Mario Gollini', 'Manager', '724, Parsley Lane, Old Town, Chicago, IL', 351258074, 'Mario.g@littlelemon.com', '$70,000')
(2, 'Adrian Gollini', 'Assistant Manager', '334, Dill Square, Lincoln Park, Chicago, IL', 351474048, 'Adrian.g@littlelemon.com', '$65,000')

In [21]:
cursor.execute("SHOW PROCEDURE STATUS WHERE Db = 'little_lemon_db'")
results = cursor.fetchall()
for i in results:
    print(i)

('little_lemon_db', 'BasicSalesReport', 'PROCEDURE', 'dmtwong@%', datetime.datetime(2024, 11, 20, 12, 19, 7), datetime.datetime(2024, 11, 20, 12, 19, 7), 'DEFINER', b'', 'utf8mb4', 'utf8mb4_0900_ai_ci', 'utf8mb4_0900_ai_ci')
('little_lemon_db', 'GuestStatus', 'PROCEDURE', 'dmtwong@%', datetime.datetime(2024, 11, 22, 16, 59, 14), datetime.datetime(2024, 11, 22, 16, 59, 14), 'DEFINER', b'', 'utf8mb4', 'utf8mb4_0900_ai_ci', 'utf8mb4_0900_ai_ci')
('little_lemon_db', 'PeakHours', 'PROCEDURE', 'dmtwong@%', datetime.datetime(2024, 11, 19, 15, 45, 46), datetime.datetime(2024, 11, 19, 15, 45, 46), 'DEFINER', b'', 'utf8mb4', 'utf8mb4_0900_ai_ci', 'utf8mb4_0900_ai_ci')